# -*- org-confirm-babel-evaluate: nil -*-
#+TITLE: languages samples

Given is a list of the numbers from 1 to 4, calculate the power of 2 for every number and then sum up the results.

* Java Virtual Machine

The JVM has a huge amout of libraries and products.

Products: Apache Tomcat, Jetty, JBoss

** Java

#+begin_src java
    IntStream.rangeClosed(1, 4).map(n -> n * n).reduce(Integer::sum).getAsInt()
#+end_src


** Kotlin

Kotlin is the preferred programming language for the Android platform.

Products: IntelliJ IDEA, Trello

#+begin_src kotlin
    (1..4).map({n -> n * n}).sum()
#+end_src


** Groovy

Groovy was originally designed as the standard script language for java.
You can create Domain-specific language very easy with groovy.

Products: Gradle, Grails, Spock

#+begin_src groovy
    (1..4).collect { it * it }.sum()
#+end_src


** Scala

Products: Apache Spark, Apache Kafka, Akka

#+begin_src scala
    (1 to 4).map { n  => n * n  }.sum
#+end_src


** Clojure

#+begin_src clojure
    (reduce + (map #(* % %) (range 1 5)))
#+end_src


* Erlang OTP

Code can compiled and replaced in a running system remotely without restarting the server. 
The languages ar erlang and elixir.

Products: RabbitMQ, Couchbase Server, Riak

** Erlang

#+begin_src erlang
    lists:sum(lists:map(fun(X) -> math:pow(2,X) end, lists:seq(1,4))).
#+end_src


** Elixir

#+begin_src elixir
    1..4 |> Enum.map(fn n -> n * n end) |> Enum.sum()
#+end_src

* Ruby

Products: Ruby on Rails, Puppet

#+begin_src ruby
    (1..4).map { |n| n * n }.sum()
#+end_src


* Python

Products: ansible, yum, ubuntu software center, Django, Google App Engine, Mercurial, OpenStack

#+begin_src python
    sum([ n * n for n in range(1, 5) ])
#+end_src


* Common Lisp

Products: Emacs

In common list you have to extend the language with your own range command:

#+begin_src elisp
  (defun range (min max)
    (cl-loop for n from min below max by 1
      collect n))

  (seq-reduce (lambda (x y) (* x y)) (range 1 5) 1)
#+end_src

#+RESULTS:
: 24
